; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v13)
             (pred_4 ?v3 ?v11)
             (pred_10 ?v8 ?v11)
             (pred_5 ?v10 ?v8 )
	     (pred_1 ?v8)
             (pred_2 ?v5)
             (pred_9 ?v3)
             (pred_11 ?v11)
             (pred_3 ?v8)
             (pred_12 ?v3)
             (pred_7 ?v8)
             (pred_8 ))



(:action op_4
:parameters (?v4 ?v7 ?v2 ?v12)
:precondition (and (pred_2 ?v4) (pred_2 ?v7) (pred_9 ?v2) (pred_11 ?v12)
          (pred_6 ?v4 ?v7) (pred_4 ?v2 ?v12)
                   (pred_10 ?v7 ?v12) (pred_1 ?v4) 
                   (pred_3 ?v7) (pred_12 ?v2))
:effect (and  (pred_7 ?v7) (not (pred_3 ?v7))))


(:action op_2
:parameters (?v4 ?v9)
:precondition (and (pred_2 ?v4) (pred_2 ?v9)
               (pred_1 ?v4) (pred_6 ?v4 ?v9) (pred_7 ?v9))
:effect (and (pred_1 ?v9) (not (pred_1 ?v4))))

(:action op_3
:parameters (?v4 ?v2)
:precondition (and (pred_2 ?v4) (pred_9 ?v2) 
                  (pred_1 ?v4) (pred_5 ?v2 ?v4) (pred_8 ))
:effect (and (pred_12 ?v2)
   (not (pred_5 ?v2 ?v4)) (not (pred_8 ))))


(:action op_5
:parameters (?v4 ?v6 ?v1)
:precondition (and (pred_2 ?v4) (pred_9 ?v6) (pred_9 ?v1)
                  (pred_1 ?v4) (pred_12 ?v1) (pred_5 ?v6 ?v4))
:effect (and (pred_12 ?v6) (pred_5 ?v1 ?v4)
        (not (pred_12 ?v1)) (not (pred_5 ?v6 ?v4))))

(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_2 ?v4) (pred_9 ?v2) 
                  (pred_1 ?v4) (pred_12 ?v2))
:effect (and (pred_8 ) (pred_5 ?v2 ?v4) (not (pred_12 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_12 obj_03 obj_04 obj_07 obj_14 obj_06 obj_05 obj_16 obj_02 obj_08 obj_10 obj_01 obj_11 obj_13 obj_17
    obj_18 obj_20
    obj_09 obj_19
    )

    (:init
       (pred_8)

       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_16)
       (pred_2 obj_02)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_01)
       (pred_2 obj_11)
       (pred_2 obj_13)
       (pred_2 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_9 obj_09)
       (pred_9 obj_19)

       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_12 obj_14)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_10 obj_17)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_17 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_10  obj_15 obj_18)
       (pred_10  obj_01 obj_20)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_10)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_17)

       (pred_4  obj_09 obj_18)
       (pred_4  obj_19 obj_20)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_19 obj_03)
       (pred_1 obj_04)
    )

    (:goal (and
       (pred_5 obj_09 obj_08)
    ))
(:constraints
  (always (not (pred_1 obj_06)))
)
)

; plan
1. (op_2 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 0 of 1
2. (op_3 obj_05 obj_09)
   deleted: (pred_5 obj_09 obj_05) (pred_8)
   added: (pred_12 obj_09)
   goals met: 0 of 1
3. (op_2 obj_05 obj_10)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_10)
   goals met: 0 of 1
4. (op_2 obj_10 obj_08)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_8) (pred_5 obj_09 obj_08)
   goals met: 1 of 1
